rLoopTeam/eng-software-teensy/workspace.kds/USB Serial Demo/CMSIS/MK20LH7.h
/*! @name WP7816T0 - UART 7816 Wait Parameter Register */
#define UART_WP7816T0_WI_MASK                    (0xFFU)
#define UART_WP7816T0_WI_SHIFT                   (0U)
#define UART_WP7816T0_WI(x)                      (((uint8_t)(((uint8_t)(x)) << UART_WP7816T0_WI_SHIFT)) & UART_WP7816T0_WI_MASK)

/*! @name WP7816T1 - UART 7816 Wait Parameter Register */
#define UART_WP7816T1_BWI_MASK                   (0xFU)
#define UART_WP7816T1_BWI_SHIFT                  (0U)
#define UART_WP7816T1_BWI(x)                     (((uint8_t)(((uint8_t)(x)) << UART_WP7816T1_BWI_SHIFT)) & UART_WP7816T1_BWI_MASK)
#define UART_WP7816T1_CWI_MASK                   (0xF0U)
#define UART_WP7816T1_CWI_SHIFT                  (4U)
#define UART_WP7816T1_CWI(x)                     (((uint8_t)(((uint8_t)(x)) << UART_WP7816T1_CWI_SHIFT)) & UART_WP7816T1_CWI_MASK)

/*! @name WN7816 - UART 7816 Wait N Register */
#define UART_WN7816_GTN_MASK                     (0xFFU)
#define UART_WN7816_GTN_SHIFT                    (0U)
#define UART_WN7816_GTN(x)                       (((uint8_t)(((uint8_t)(x)) << UART_WN7816_GTN_SHIFT)) & UART_WN7816_GTN_MASK)

/*! @name WF7816 - UART 7816 Wait FD Register */
#define UART_WF7816_GTFD_MASK                    (0xFFU)
#define UART_WF7816_GTFD_SHIFT                   (0U)
#define UART_WF7816_GTFD(x)                      (((uint8_t)(((uint8_t)(x)) << UART_WF7816_GTFD_SHIFT)) & UART_WF7816_GTFD_MASK)

/*! @name ET7816 - UART 7816 Error Threshold Register */
#define UART_ET7816_RXTHRESHOLD_MASK             (0xFU)
#define UART_ET7816_RXTHRESHOLD_SHIFT            (0U)
#define UART_ET7816_RXTHRESHOLD(x)               (((uint8_t)(((uint8_t)(x)) << UART_ET7816_RXTHRESHOLD_SHIFT)) & UART_ET7816_RXTHRESHOLD_MASK)
#define UART_ET7816_TXTHRESHOLD_MASK             (0xF0U)
#define UART_ET7816_TXTHRESHOLD_SHIFT            (4U)
#define UART_ET7816_TXTHRESHOLD(x)               (((uint8_t)(((uint8_t)(x)) << UART_ET7816_TXTHRESHOLD_SHIFT)) & UART_ET7816_TXTHRESHOLD_MASK)

/*! @name TL7816 - UART 7816 Transmit Length Register */
#define UART_TL7816_TLEN_MASK                    (0xFFU)
#define UART_TL7816_TLEN_SHIFT                   (0U)
#define UART_TL7816_TLEN(x)                      (((uint8_t)(((uint8_t)(x)) << UART_TL7816_TLEN_SHIFT)) & UART_TL7816_TLEN_MASK)

/*! @name C6 - UART CEA709.1-B Control Register 6 */
#define UART_C6_CP_MASK                          (0x10U)
#define UART_C6_CP_SHIFT                         (4U)
#define UART_C6_CP(x)                            (((uint8_t)(((uint8_t)(x)) << UART_C6_CP_SHIFT)) & UART_C6_CP_MASK)
#define UART_C6_CE_MASK                          (0x20U)
#define UART_C6_CE_SHIFT                         (5U)
#define UART_C6_CE(x)                            (((uint8_t)(((uint8_t)(x)) << UART_C6_CE_SHIFT)) & UART_C6_CE_MASK)
#define UART_C6_TX709_MASK                       (0x40U)
#define UART_C6_TX709_SHIFT                      (6U)
#define UART_C6_TX709(x)                         (((uint8_t)(((uint8_t)(x)) << UART_C6_TX709_SHIFT)) & UART_C6_TX709_MASK)
#define UART_C6_EN709_MASK                       (0x80U)
#define UART_C6_EN709_SHIFT                      (7U)
#define UART_C6_EN709(x)                         (((uint8_t)(((uint8_t)(x)) << UART_C6_EN709_SHIFT)) & UART_C6_EN709_MASK)

/*! @name PCTH - UART CEA709.1-B Packet Cycle Time Counter High */
#define UART_PCTH_PCTH_MASK                      (0xFFU)
#define UART_PCTH_PCTH_SHIFT                     (0U)
#define UART_PCTH_PCTH(x)                        (((uint8_t)(((uint8_t)(x)) << UART_PCTH_PCTH_SHIFT)) & UART_PCTH_PCTH_MASK)

/*! @name PCTL - UART CEA709.1-B Packet Cycle Time Counter Low */
#define UART_PCTL_PCTL_MASK                      (0xFFU)
#define UART_PCTL_PCTL_SHIFT                     (0U)
#define UART_PCTL_PCTL(x)                        (((uint8_t)(((uint8_t)(x)) << UART_PCTL_PCTL_SHIFT)) & UART_PCTL_PCTL_MASK)

/*! @name B1T - UART CEA709.1-B Beta1 Timer */
#define UART_B1T_B1T_MASK                        (0xFFU)
#define UART_B1T_B1T_SHIFT                       (0U)
#define UART_B1T_B1T(x)                          (((uint8_t)(((uint8_t)(x)) << UART_B1T_B1T_SHIFT)) & UART_B1T_B1T_MASK)

/*! @name SDTH - UART CEA709.1-B Secondary Delay Timer High */
#define UART_SDTH_SDTH_MASK                      (0xFFU)
#define UART_SDTH_SDTH_SHIFT                     (0U)
#define UART_SDTH_SDTH(x)                        (((uint8_t)(((uint8_t)(x)) << UART_SDTH_SDTH_SHIFT)) & UART_SDTH_SDTH_MASK)

/*! @name SDTL - UART CEA709.1-B Secondary Delay Timer Low */
#define UART_SDTL_SDTL_MASK                      (0xFFU)
#define UART_SDTL_SDTL_SHIFT                     (0U)
#define UART_SDTL_SDTL(x)                        (((uint8_t)(((uint8_t)(x)) << UART_SDTL_SDTL_SHIFT)) & UART_SDTL_SDTL_MASK)

/*! @name PRE - UART CEA709.1-B Preamble */
#define UART_PRE_PREAMBLE_MASK                   (0xFFU)
#define UART_PRE_PREAMBLE_SHIFT                  (0U)
#define UART_PRE_PREAMBLE(x)                     (((uint8_t)(((uint8_t)(x)) << UART_PRE_PREAMBLE_SHIFT)) & UART_PRE_PREAMBLE_MASK)

/*! @name TPL - UART CEA709.1-B Transmit Packet Length */
#define UART_TPL_TPL_MASK                        (0xFFU)
#define UART_TPL_TPL_SHIFT                       (0U)
#define UART_TPL_TPL(x)                          (((uint8_t)(((uint8_t)(x)) << UART_TPL_TPL_SHIFT)) & UART_TPL_TPL_MASK)

/*! @name IE - UART CEA709.1-B Interrupt Enable Register */
#define UART_IE_TXFIE_MASK                       (0x1U)
#define UART_IE_TXFIE_SHIFT                      (0U)
#define UART_IE_TXFIE(x)                         (((uint8_t)(((uint8_t)(x)) << UART_IE_TXFIE_SHIFT)) & UART_IE_TXFIE_MASK)
#define UART_IE_PSIE_MASK                        (0x2U)
#define UART_IE_PSIE_SHIFT                       (1U)
#define UART_IE_PSIE(x)                          (((uint8_t)(((uint8_t)(x)) << UART_IE_PSIE_SHIFT)) & UART_IE_PSIE_MASK)
#define UART_IE_PCTEIE_MASK                      (0x4U)
#define UART_IE_PCTEIE_SHIFT                     (2U)
#define UART_IE_PCTEIE(x)                        (((uint8_t)(((uint8_t)(x)) << UART_IE_PCTEIE_SHIFT)) & UART_IE_PCTEIE_MASK)
#define UART_IE_PTXIE_MASK                       (0x8U)
#define UART_IE_PTXIE_SHIFT                      (3U)
#define UART_IE_PTXIE(x)                         (((uint8_t)(((uint8_t)(x)) << UART_IE_PTXIE_SHIFT)) & UART_IE_PTXIE_MASK)
#define UART_IE_PRXIE_MASK                       (0x10U)
#define UART_IE_PRXIE_SHIFT                      (4U)
#define UART_IE_PRXIE(x)                         (((uint8_t)(((uint8_t)(x)) << UART_IE_PRXIE_SHIFT)) & UART_IE_PRXIE_MASK)
#define UART_IE_ISDIE_MASK                       (0x20U)
#define UART_IE_ISDIE_SHIFT                      (5U)
#define UART_IE_ISDIE(x)                         (((uint8_t)(((uint8_t)(x)) << UART_IE_ISDIE_SHIFT)) & UART_IE_ISDIE_MASK)
#define UART_IE_WBEIE_MASK                       (0x40U)
#define UART_IE_WBEIE_SHIFT                      (6U)
#define UART_IE_WBEIE(x)                         (((uint8_t)(((uint8_t)(x)) << UART_IE_WBEIE_SHIFT)) & UART_IE_WBEIE_MASK)

/*! @name WB - UART CEA709.1-B WBASE */
#define UART_WB_WBASE_MASK                       (0xFFU)
#define UART_WB_WBASE_SHIFT                      (0U)
#define UART_WB_WBASE(x)                         (((uint8_t)(((uint8_t)(x)) << UART_WB_WBASE_SHIFT)) & UART_WB_WBASE_MASK)

/*! @name S3 - UART CEA709.1-B Status Register */
#define UART_S3_TXFF_MASK                        (0x1U)
#define UART_S3_TXFF_SHIFT                       (0U)
#define UART_S3_TXFF(x)                          (((uint8_t)(((uint8_t)(x)) << UART_S3_TXFF_SHIFT)) & UART_S3_TXFF_MASK)
#define UART_S3_PSF_MASK                         (0x2U)
#define UART_S3_PSF_SHIFT                        (1U)
#define UART_S3_PSF(x)                           (((uint8_t)(((uint8_t)(x)) << UART_S3_PSF_SHIFT)) & UART_S3_PSF_MASK)
#define UART_S3_PCTEF_MASK                       (0x4U)
#define UART_S3_PCTEF_SHIFT                      (2U)
#define UART_S3_PCTEF(x)                         (((uint8_t)(((uint8_t)(x)) << UART_S3_PCTEF_SHIFT)) & UART_S3_PCTEF_MASK)
#define UART_S3_PTXF_MASK                        (0x8U)
#define UART_S3_PTXF_SHIFT                       (3U)
#define UART_S3_PTXF(x)                          (((uint8_t)(((uint8_t)(x)) << UART_S3_PTXF_SHIFT)) & UART_S3_PTXF_MASK)
#define UART_S3_PRXF_MASK                        (0x10U)
#define UART_S3_PRXF_SHIFT                       (4U)
#define UART_S3_PRXF(x)                          (((uint8_t)(((uint8_t)(x)) << UART_S3_PRXF_SHIFT)) & UART_S3_PRXF_MASK)
#define UART_S3_ISD_MASK                         (0x20U)
#define UART_S3_ISD_SHIFT                        (5U)
#define UART_S3_ISD(x)                           (((uint8_t)(((uint8_t)(x)) << UART_S3_ISD_SHIFT)) & UART_S3_ISD_MASK)
#define UART_S3_WBEF_MASK                        (0x40U)
#define UART_S3_WBEF_SHIFT                       (6U)
#define UART_S3_WBEF(x)                          (((uint8_t)(((uint8_t)(x)) << UART_S3_WBEF_SHIFT)) & UART_S3_WBEF_MASK)
#define UART_S3_PEF_MASK                         (0x80U)
#define UART_S3_PEF_SHIFT                        (7U)
#define UART_S3_PEF(x)                           (((uint8_t)(((uint8_t)(x)) << UART_S3_PEF_SHIFT)) & UART_S3_PEF_MASK)

/*! @name S4 - UART CEA709.1-B Status Register */
#define UART_S4_FE_MASK                          (0x1U)
#define UART_S4_FE_SHIFT                         (0U)
#define UART_S4_FE(x)                            (((uint8_t)(((uint8_t)(x)) << UART_S4_FE_SHIFT)) & UART_S4_FE_MASK)
#define UART_S4_ILCV_MASK                        (0x2U)
#define UART_S4_ILCV_SHIFT                       (1U)
#define UART_S4_ILCV(x)                          (((uint8_t)(((uint8_t)(x)) << UART_S4_ILCV_SHIFT)) & UART_S4_ILCV_MASK)
#define UART_S4_CDET_MASK                        (0xCU)
#define UART_S4_CDET_SHIFT                       (2U)
#define UART_S4_CDET(x)                          (((uint8_t)(((uint8_t)(x)) << UART_S4_CDET_SHIFT)) & UART_S4_CDET_MASK)
#define UART_S4_INITF_MASK                       (0x10U)
#define UART_S4_INITF_SHIFT                      (4U)
#define UART_S4_INITF(x)                         (((uint8_t)(((uint8_t)(x)) << UART_S4_INITF_SHIFT)) & UART_S4_INITF_MASK)

/*! @name RPL - UART CEA709.1-B Received Packet Length */
#define UART_RPL_RPL_MASK                        (0xFFU)
#define UART_RPL_RPL_SHIFT                       (0U)
#define UART_RPL_RPL(x)                          (((uint8_t)(((uint8_t)(x)) << UART_RPL_RPL_SHIFT)) & UART_RPL_RPL_MASK)

